reddit_clone/app/views/posts/new.html.erb

    <input type="hidden" name="post[tag_ids][]" value="">
    <% Sub.all.each do |sub| %>
---
SELECT "subs".* FROM "subs"