reddit_clone/app/controllers/posts_controller.rb

INSERT INTO "posts" ("user_id", "title", "url", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 3], ["title", "Food"], ["url", "food.com"], ["content", "fooooood"], ["created_at", "2019-05-07 20:42:14.957996"], ["updated_at", "2019-05-07 20:42:14.957996"]]
INSERT INTO "post_subs" ("post_id", "sub_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["post_id", 4], ["sub_id", 1], ["created_at", "2019-05-07 20:43:24.370204"], ["updated_at", "2019-05-07 20:43:24.370204"]]
---
  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id


    if @post.save
      params[:post][:sub_ids].each do |sub_id|
        PostSub.create!(post_id: @post.id, sub_id: sub_id)

SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["user_id", 3], ["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "title" = $1, "url" = $2, "content" = $3, "updated_at" = $4 WHERE "posts"."id" = $5  [["title", "Funkn Waffles"], ["url", "https://www.funknwaffles.com/"], ["content", "wow good chikn n waffle  "], ["updated_at", "2019-05-07 19:27:04.304662"], ["id", 1]]
---
  def update
    @post = current_user.posts.find(params[:id])
    if @post.update_attributes(post_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def ensure_author
    @post = Post.find(params[:id])