reddit_clone/app/views/subs/show.html.erb

 <ul>
    <% @sub.posts.each do |p| %>
---
SELECT "posts".* FROM "posts" INNER JOIN "post_subs" ON "posts"."id" = "post_subs"."post_id" WHERE "post_subs"."sub_id" = $1  [["sub_id", 1]]